In [116]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression

In [117]:
df=pd.read_csv("hiring.csv")

In [118]:
df.head()

   experience  test_score  interview_score(out of 10)  salary($)
0           0         8.0                           9      50000
1           0         8.0                           6      45000
2           5         6.0                           7      60000
3           2        10.0                          10      65000
4           7         9.0                           6      70000

In [119]:
df['experience'].describe()

count     8.00000
mean      4.75000
std       4.26782
min       0.00000
25%       1.50000
50%       4.00000
75%       7.75000
max      11.00000
Name: experience, dtype: float64

In [120]:
df

   experience  test_score  interview_score(out of 10)  salary($)
0           0         8.0                           9      50000
1           0         8.0                           6      45000
2           5         6.0                           7      60000
3           2        10.0                          10      65000
4           7         9.0                           6      70000
5           3         7.0                          10      62000
6          10         NaN                           7      72000
7          11         7.0                           8      80000

In [121]:
df.experience=df.experience.fillna(df.experience.fillna(df.experience.median()))

In [122]:
df.test_score=df.test_score.fillna(df.test_score.median())

In [123]:
df

   experience  test_score  interview_score(out of 10)  salary($)
0           0         8.0                           9      50000
1           0         8.0                           6      45000
2           5         6.0                           7      60000
3           2        10.0                          10      65000
4           7         9.0                           6      70000
5           3         7.0                          10      62000
6          10         8.0                           7      72000
7          11         7.0                           8      80000

In [124]:
MLR=LinearRegression()

In [125]:
x=df[['experience','test_score','interview_score(out of 10)']]
y=df[['salary($)']]

In [126]:
MLR.fit(x,y)

LinearRegression()

## 2 yr experience, 9 test score, 6 interview score

In [127]:
MLR.predict([[2,9,6]])

array([[53205.96797671]])

#

In [128]:
MLR.predict([[12,10,10]])

array([[92002.18340611]])

In [130]:
import pickle 
pickle.dump(open("MLRsalary"),'wb')

TypeError: file must have a 'write' attribute